routes and controllers/demo_project/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 3], ["created_at", "2023-03-09 22:09:18.154230"], ["updated_at", "2023-03-09 22:09:18.154230"]]
---
    def create
        artworkshare = ArtworkShare.new(params.require(:artwork_shares).permit(:artwork_id, :viewer_id))
        if artworkshare.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]
---
    def destroy
        artworkshare = ArtworkShare.find(params[:id])
        artworkshare.destroy