routes and controllers/demo_project/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Scribble"], ["image_url", "art.6.com"], ["artist_id", 4], ["created_at", "2023-03-09 21:53:21.661271"], ["updated_at", "2023-03-09 21:53:21.661271"]]
---
    def create
        artwork = Artwork.new(params.require(:artwork).permit(:title, :image_url, :artist_id))
        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Skribble"], ["image_url", "art.7.com"], ["updated_at", "2023-03-09 21:55:13.304019"], ["id", 6]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update!(params.permit(:title, :image_url, :artist_id))