routes and controllers/demo_project/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(params.require(:comment).permit(:body, :author_id, :artwork_id))
        if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"Hello\""], ["author_id", 1], ["artwork_id", 3], ["created_at", "2023-03-10 00:58:07.247613"], ["updated_at", "2023-03-10 00:58:07.247613"]]