routes and controllers/demo_project/app/controllers/users_controller.rb

    def index
        # debugger
        if params[:search]
            @users = User.where('username ILIKE ?', "%#{params[:search]}%")
        else
            @users = User.all
---
SELECT "users".* FROM "users" WHERE (username = 'params[:search]')
SELECT "users".* FROM "users"

    def create
        # user = User.new(params.permit(:name, :email))
        # user.save!
        # render json: user
        user = User.new(params.require(:user).permit(:username))
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "john"], ["email", "john.email.com"], ["created_at", "2023-03-09 00:51:03.463005"], ["updated_at", "2023-03-09 00:51:03.463005"]]

    def update
        user = User.find(params[:id])
        if user.update!(params.permit(:username))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Deric"], ["email", "deric.gmail.com"], ["updated_at", "2023-03-09 01:05:22.276362"], ["id", 1]]